app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
        <strong>URL</strong> <%= link_to user_path(@user), @user %><br />
        <strong>Microposts</strong> <%= @user.microposts.count %>