app/views/shared/_user_info.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 92
---
    <span class="">
      <%= pluralize(current_user.microposts.count, "micropost") %>