app/controllers/users_controller.rb

  def index
    @title = 'All users'
    @users = User.paginate(:page => params[:page], :per_page => 10)
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 15 Dec 2012 19:25:12 UTC +00:00], ["email", "alex@mail.ru"], ["name", "alex"], ["updated_at", Sat, 15 Dec 2012 19:25:12 UTC +00:00]]

  def update
    #@user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'Power', "email" = 'power@mail.com', "encrypted_password" = '0549f167430acde568b4856cc25337ca8d13991641c8ed347c42732eca58586a', "updated_at" = '2012-12-22 12:57:10.054496' WHERE "users"."id" = 4